[ unix ]
├─ синтаксис - . поточна папка / .. папкою вищи, назад / * все
├─ cd шлях_до_папки - для переходу між папками, cd переходить в (~, $HOME)
├─ mkdir назва_папки - створює папку
│  └─ rmdir назва_папки - видалити папку
├─ ls шлях_до_папки - виводить список файлів що є в папці, ls вивід поточної папки
│  ├─ -a - показує також скриті файли (.file)
│  └─ -l - виводить всю інформацію про файли
├─ cat шлях_до_файлу - виводить вміст файлу
│  └─ >> - переглянути і записати щось (enter -> C^)
├─ echo "текст" - виводить просто текст
├─ pwd - виводить шлях до поточної папки
├─ whereis назва_файл - шукає файл тільки в /usr/
├─ clear - очищає консоль
