[ unix ]
├─ синтаксис - . поточна папка / .. папкою вищи, назад / * все
│  └─ --help - прапор для виводу інформації про команду
├─ cd /... - для переходу між папками, cd переходить в (~, $HOME)
├─ mkdir /папка - створює папку
│  └─ rmdir назва_папки - видалити папку
├─ rm /... - видаляє
├─ sudo ... - виконання команди від root прав
├─ mv /файл /... - перекинути файл в іншу папку чи переіминувати його
├─ cp /файл /... - скопіювати файл в іншу папку чи скопіювати і переіминувати
├─ ls | /папка - виводить список файлів що є в папці
│     ├─ -a - показує також скриті файли (.file)
│     └─ -l - виводить всю інформацію про файли
├─ cat | /файл | - виводить вміст файлу
│      └─ >> - | записати щось в кінець файлу (enter -> C^)
│              └─ | grep текст - виводить тільки ці рядки де є вказаний текст
├─ wget | https://... - скачати щось з інтернету
│       └─ --directory-prefix=/повний_шлях - показує куди скачати файл
├─ echo 'текст' - виводить просто текст
│  └─ "$..." - для вивидиня якоїсь зміної
├─ pwd - виводить шлях до поточної папки
├─ whereis файл - шукає файл тільки в /usr/
├─ top - програма моніторингу пк
└─ clear - очищає консоль

[ bash ]
├─ #!/bin/bash - перший рядок
├─ # ... - коментар
├─ bash name_script.sh - виконати скрипт
├─[ параметри ]
│ ├─ bash name_script.sh parameter_1 parameter_2 ...
│ │       └─ $0          └─ $1       └─ $2       └─ $...
│ ├─ додаткові парамитри - [ $HOME - деректорія користувача (~) ] ... 
│ ├─ parameter_name=$1 - приямає параметр який переданий при запуску скрипта
│ └─ $... - можна використовувати зразу параметр 
├─[ умови ]
│ ├─
